# ErrorType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeyBasedTreeEntryError..::..ErrorType Property
KeyBasedTreeEntryError Class See Also
---
Indicates which of possible types of problems with loading and/or building a KeyBasedTreeEntries that this KeyBasedTreeEntryError represents.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public KeyBasedTreeEntryErrorType ErrorType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ErrorType As KeyBasedTreeEntryErrorType
	Get
```

Visual C++
---
```text
public:
property KeyBasedTreeEntryErrorType ErrorType {
	KeyBasedTreeEntryErrorType get ();
}
```

# See Also
KeyBasedTreeEntryError Class
Autodesk.Revit.DB Namespace